In [1]:
import pandas as pd
import mysql.connector as mysql
from sqlalchemy import create_engine

In [2]:
table_name = "markets"

In [3]:
# Import CSV data
df = pd.read_csv(f"data/database_tables/{table_name}.csv")

In [4]:
# Connect to database
db = mysql.connect(
    host = "localhost",
    user = "root",
    passwd = "oFbByWK22xi2+Ah^",
    database = "value_investing_dev"
    )

cursor = db.cursor()

In [5]:
df

   id share_listing
0   1      FTSE 100
1   2      FTSE 250
2   3      FTSE 350

In [7]:
# column names and sql builder
sql_col_names = []
col_names_list = []

for col in df.columns: 
    sql_col_names.append(col)
    col_names_list.append(col.split(' ')[0])
del col_names_list[0]

sql_col_names = ', '.join(sql_col_names)

col_names_list
sql_col_names

['share_listing']

In [9]:
# Create Table
cursor.execute(f"CREATE TABLE IF NOT EXISTS {table_name} ({sql_col_names})")

In [10]:
placeholders = ', '.join(['%s'] * len(col_names_list))
columns = ', '.join(col_names_list)
sql = f"INSERT INTO {table_name} ( {columns} ) VALUES ( {placeholders} )"
sql

'INSERT INTO markets ( share_listing ) VALUES ( %s )'

In [11]:
# Populate database
iterator_table = df.iterrows()
while (True) : 
    try:
        row = next(iterator_table)[1].tolist()
        row = [str(i) for i in row]
        del row[0]
        print(row)
        cursor.execute(sql, row)
        
        db.commit()

    # if there are no more values in iterator, break the loop
    except StopIteration:
        break

['FTSE 100']
['FTSE 250']
['FTSE 350']

In [12]:
cursor._executed

b"INSERT INTO markets ( share_listing ) VALUES ( 'FTSE 350' )"

In [13]:
db.close()

In [14]:
from sqlalchemy import create_engine

In [15]:
db_connection_str = 'mysql://root:oFbByWK22xi2+Ah^@localhost/value_investing_dev'
db_connection = create_engine(db_connection_str)

In [16]:
df = pd.read_sql(f"SELECT * FROM {table_name}", con=db_connection)
df

   id share_listing
0   1      FTSE 100
1   2      FTSE 250
2   3      FTSE 350

In [17]:
db_connection.dispose()